app/Services/ClienteService.php

SELECT *
FROM `clientes`
WHERE `clientes`.`id` = 1
---
    public function getClienteById($id)
    {
        return $this->clienteModel->find($id);

SELECT *
FROM `clientes`
WHERE `login` = 'Gabriel'
 LIMIT 1
---
    public function authenticate($login,$password){
        $cliente = $this->clienteModel->where('login', $login)->first();

SELECT *
FROM `clientes`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `clientes`
---
    public function getClientes()
    {
        /*
            Retorna a lista de clientes.
        */

        try {

            $clientes = $this->clienteModel->paginate(5);